In [1]:
import pandas as pd

In [2]:
student_data = {"Name":["Ajees","Ayaana","Ayeesha","Zoya"],
        "Age":[29,1,24,9],
        "City":["Madurai","Goa","Chennai","Madurai"]}

In [3]:
data = pd.DataFrame(student_data)

In [4]:
data

      Name  Age     City
0    Ajees   29  Madurai
1   Ayaana    1      Goa
2  Ayeesha   24  Chennai
3     Zoya    9  Madurai

In [5]:
data.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [6]:
data.columns = [x.lower() for x in data.columns ]

In [7]:
data

      name  age     city
0    Ajees   29  Madurai
1   Ayaana    1      Goa
2  Ayeesha   24  Chennai
3     Zoya    9  Madurai

In [8]:
data.rename(columns = {"name":"NAME","age":"AGE"}, inplace=True)

In [9]:
data

      NAME  AGE     city
0    Ajees   29  Madurai
1   Ayaana    1      Goa
2  Ayeesha   24  Chennai
3     Zoya    9  Madurai

In [10]:
data["last name"] = "Basha"

In [11]:
data

      NAME  AGE     city last name
0    Ajees   29  Madurai     Basha
1   Ayaana    1      Goa     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    9  Madurai     Basha

In [12]:
data.rename(columns={"last name":"Last Name","city":"City"}, inplace=True)

In [13]:
data

      NAME  AGE     City Last Name
0    Ajees   29  Madurai     Basha
1   Ayaana    1      Goa     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    9  Madurai     Basha

In [14]:
data.loc[3]

NAME            Zoya
AGE                9
City         Madurai
Last Name      Basha
Name: 3, dtype: object

In [15]:
data.loc[3] = ["zoya Athifha", 9, "Tirupur", "Yasar"]

In [16]:
data

           NAME  AGE     City Last Name
0         Ajees   29  Madurai     Basha
1        Ayaana    1      Goa     Basha
2       Ayeesha   24  Chennai     Basha
3  zoya Athifha    9  Tirupur     Yasar

In [17]:
data.loc[3,["NAME","AGE"]]=["Zoya",8]

In [18]:
data

      NAME  AGE     City Last Name
0    Ajees   29  Madurai     Basha
1   Ayaana    1      Goa     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    8  Tirupur     Yasar

In [19]:
data.loc[1,"City"]="Chennai"

In [22]:
data

      NAME  AGE     City Last Name
0    Ajees   29  Madurai     Basha
1   Ayaana    1  Chennai     Basha
2  Ayeesha   24  Chennai     Basha
3     Zoya    8  Tirupur     Yasar

In [24]:
data["City"].apply(len)

0    7
1    7
2    7
3    7
Name: City, dtype: int64

In [25]:
def to_upper(City):
    return City.upper()

In [28]:
data["City"] = data["City"].apply(to_upper)

In [29]:
data

      NAME  AGE     City Last Name
0    Ajees   29  MADURAI     Basha
1   Ayaana    1  CHENNAI     Basha
2  Ayeesha   24  CHENNAI     Basha
3     Zoya    8  TIRUPUR     Yasar

In [30]:
data["City"] = data["City"].apply(lambda x : x.lower())

In [31]:
data

      NAME  AGE     City Last Name
0    Ajees   29  madurai     Basha
1   Ayaana    1  chennai     Basha
2  Ayeesha   24  chennai     Basha
3     Zoya    8  tirupur     Yasar

In [32]:
data.apply(len)

NAME         4
AGE          4
City         4
Last Name    4
dtype: int64

In [34]:
len(data["NAME"])

4

In [36]:
data.apply(len, axis='columns')

0    4
1    4
2    4
3    4
dtype: int64

In [43]:
data.applymap(str.lower)

TypeError: descriptor 'lower' for 'str' objects doesn't apply to a 'int' object

In [37]:
data.apply(pd.Series.min)

NAME           Ajees
AGE                1
City         chennai
Last Name      Basha
dtype: object